/* 
jj 2021/06/18  上午

< 09-13-20 
檢討之前的作業：simple web

09-13-20 ~ 09-45-30 
檢討之前的作業：爬蟲
講一些軟體設計的觀念

09-47-10
檢討之前的作業：爬蟲（同學問了值得研究的問題）
之間持續離題
心靈雞湯時間

10-30-55 心靈雞湯時間結束
10-32-50 建立 module 練習
    建立 modules 資料夾
    搜尋 module 的順序
    兩種 export 的寫法
    私有、公有
11-11-00 ~ 11-45-30
將很長的爬蟲程式碼，用 module 的方法縮短
    這裡出了一個回家作業

11-45-30 ~ 12-15-00
繼續 module 的話題
CommonJS vs ES6 Modules

jj 2021/06/18  下午
13-30-00 ~ 14-30-00
問：當你輸入網址開始，到網站出現，中間發生了什麼事？
IP, DNS, timeout, public IP, private IP 

14-30-00
開始講 express

03-30-00 
左右：小技巧，在 Git 上面建立一個資料夾，加入 .gitignore，但是 Github 看得到那個資料夾（但是看不到資料）
Git -f 指令

??????
講 pug

03-46-00 左右
將網頁上經常重複的原件模組化，放在一個名為 _layout 的資料夾
介紹 pug 語法

16-30-00


*/
