/* 
00-00 ~
老師檢討昨天出的作業
展示同學寫的不錯的程式碼

00-04-30 老師鼓勵去看別的同學的 issue
00-05-05 如何使用 GitHub ISSUE Filter
00-07-30 心靈雞湯時間
jj 00-09-27 網站工程師的溝通表達能力必須要很好！
00-11-00 冒牌者症候群 
00-15-00 推薦電影“關鍵少數”
00-16-20 遇見 TED 演講，我們如何教導電腦看懂圖像

00-24-05 開始上課，檢討昨天作業的問題
    資明的問題：之前把帳密寫在檔案裡上傳到 GitHub，現在刪掉檔案裡的帳密，但 GitHub 歷史記錄還是有之前的帳密
    承恩的問題：連資料庫的過程要做很多次驗證，我想知道怎麼寫錯誤處理比較好
00-25-10 ~ 00-42-00 回答承恩的問題
    00-32-28 程式上錯誤處理的一個技巧（避免 if else hell），沒有標準答案
    00-37-18 討論錯誤處理：錯誤處理是一門學問！
        jj 推薦 clean code 這一本書，等到基本語法都學完，寫一陣子 code 再看（進階的書）


*/
